# -*- ii: y; -*-
#+TITLE: test writing

** Update YOUPIP.xip.io

   #+begin_src shell :dir "."
     CURRENT_IP=127.0.0.1 # the default
     NEW_IP=$(curl ifconfig.co) # or IP of choice
     sed -i s:$CURRENT_IP:$NEW_IP:g kustomize/*yaml
     echo http://tilt.$NEW_IP.xip.io
     echo http://pgadmin.$NEW_IP.xip.io
     echo http://hasura.$NEW_IP.xip.io
     echo http://apisnoop.$NEW_IP.xip.io
   #+end_src

   #+RESULTS:
   #+begin_example
   http://tilt.147.75.91.66.xip.io
   http://pgadmin.147.75.91.66.xip.io
   http://hasura.147.75.91.66.xip.io
   http://apisnoop.147.75.91.66.xip.io
   #+end_example

** Optionally Update *.local.ii.coop -> *.YOU.your.domain

   #+begin_src shell :dir "."
     CURRENT_DOMAIN=local.ii.coop
     NEW_DOMAIN=hh.ii.coop
     sed -i s:$CURRENT_DOMAIN:$NEW_DOMAIN:g kustomize/*yaml
     echo http://tilt.$NEW_DOMAIN
     echo http://pgadmin.$NEW_DOMAIN
     echo http://hasura.$NEW_DOMAIN
     echo http://apisnoop.$NEW_DOMAIN
   #+end_src

   #+RESULTS:
   #+begin_example
   http://tilt.hh.ii.coop
   http://pgadmin.hh.ii.coop
   http://hasura.hh.ii.coop
   http://apisnoop.hh.ii.coop
   #+end_example

* Reset basic-auth password

The default basic-auth user: ii pass: ii.
To change it, just update the basic-auth secret.

  #+name: reset basic-auth password
  #+begin_src shell
    kubectl delete secret basic-auth
    kubectl create secret generic basic-auth \
      --from-literal=auth=$(
        LOGIN=hh
        PASSWORD=ii
        echo $PASSWORD | htpasswd -i -n $LOGIN)
  #+end_src

  #+RESULTS: reset basic-auth password
  #+begin_example
  secret "basic-auth" deleted
  secret/basic-auth created
  #+end_example

